pk_dict = {
    120300: "待审批"
    ,

    220305: "审核通过"
    ,

    321001: "污水处理厂"
    ,

    341201: "圆形"
    ,

    332401: "无审批手续"
    ,
    332811: "规模化畜禽养殖排污口"
    ,

    100801: "摄像头资源组"
    ,

    321701: "管理责任主体"
    ,

    320101: "东"
    ,

    321901: "河道"
    ,

    121001: "待分配"
    ,

    120401: "排口新增"
    ,

    120301: "审批未通过"
    ,

    341401: "资料溯源"
    ,

    100701: "正常"
    ,

    332301: "入河排污口设置审批手续"
    ,

    320406: "桥洞"
    ,

    321801: "一级河长"
    ,

    321201: "水质快检包"
    ,

    320901: "工业区"
    ,

    341501: "QV"
    ,

    320801: "清水"
    ,

    332501: "混凝土"
    ,

    332901: "Ⅱ类"
    ,

    100601: "新增权限"
    ,

    100201: "超级管理员"
    ,

    321501: "排口照片"
    ,

    322001: "跨区"
    ,

    110101: "wfs"
    ,

    332601: "现场采样"
    ,

    321401: "快速检测信息"
    ,

    320206: "疑似暗管"
    ,

    320201: "国家环保部牵头"
    ,

    333401: "排水"
    ,

    334100: "一家一户的生活污水排放口"
    ,

    320302: "明渠"
    ,

    350101: "上报排查信息"
    ,

    332701: "原位采样"
    ,

    220304: "审核不通过"
    ,

    332822: "大中型灌区排口"
    ,

    320702: "间歇"
    ,

    332813: "工矿企业排污口"
    ,

    321601: "水浸传感器"
    ,

    100501: "船舶"
    ,

    332817: "城镇污水处理厂排污口"
    ,

    220250: "待整治"
    ,

    332801: "工业排污口"
    ,

    220201: "添加整治记录"
    ,

    333301: "工业废水"
    ,

    100401: "页面"
    ,

    322201: "排污问题未整改"
    ,

    322101: "有排污许可证未过期"
    ,

    342201: "未发现问题"
    ,

    220251: "整治中"
    ,

    333201: "水环境功能区"
    ,

    321111: "一般节点"
    ,

    321301: "OSS云存储"
    ,

    333101: "上海市生态环境局"
    ,

    333001: "上海市水务局"
    ,

    100101: "系统用户组"
    ,

    332602: "其他单位来样"
    ,

    100802: "船舶资源组"
    ,

    100602: "删除权限"
    ,

    100702: "停用"
    ,

    320701: "连续"
    ,

    321702: "第一排污责任主体"
    ,

    220202: "编辑整治计划"
    ,

    341202: "方形"
    ,

    341402: "人工排查"
    ,

    341502: "示踪剂"
    ,

    332702: "上游采样"
    ,

    350102: "修改排查信息"
    ,

    332812: "规模化水产养殖排污口"
    ,

    334101: "农田、鱼塘间的换水口"
    ,

    332814: "工矿企业雨洪排口"
    ,

    333302: "商业污水"
    ,

    332826: "种植业退水排口"
    ,

    342202: "位于饮用水水源保护区"
    ,

    333202: "海洋环境功能区"
    ,

    333102: "上海市宝山区生态环境局"
    ,

    333002: "上海市生态环境局"
    ,

    320202: "长江沿岸两公里"
    ,

    120402: "排口维护"
    ,

    121002: "未开始"
    ,

    120302: "审批通过"
    ,

    320102: "南"
    ,

    332902: "Ⅲ类"
    ,

    332502: "塑料"
    ,

    320802: "黑臭"
    ,

    332402: "与许可内容不一致"
    ,

    321302: "FASTDFS本地存储"
    ,

    322002: "界河"
    ,

    321502: "周边环境照片"
    ,

    320902: "居民区"
    ,

    320407: "取水口/取料管"
    ,

    322202: "常规管理"
    ,

    321002: "农村生活污水"
    ,

    321112: "污水过流点"
    ,

    320301: "管道"
    ,

    332302: "应纳未纳"
    ,

    321602: "智能液位仪"
    ,

    321402: "实验室检测信息"
    ,

    321802: "二级河长"
    ,

    321902: "湖泊"
    ,

    100102: "私有用户组"
    ,

    110102: "wms"
    ,

    100202: "普通管理员"
    ,

    100402: "按钮"
    ,

    100502: "导航仪"
    ,

    322102: "有排污许可证已过期"
    ,

    220252: "一级审核"
    ,

    220253: "二级审核"
    ,

    333003: "上海市宝山区生态环境局"
    ,

    321403: "液位感应监测"
    ,

    322203: "其他问题未整改"
    ,

    342203: "处于生态保护红线、自然保护区等自然保护地范围内"
    ,

    100503: "摄像头"
    ,

    321113: "污水接入点"
    ,

    333303: "生活污水"
    ,

    100403: "其他"
    ,

    350103: "排查信息审核通过"
    ,

    321603: "流量计"
    ,

    333404: "无水"
    ,

    334102: "桥梁、道路、堤坝两侧泄水口"
    ,

    320303: "泵站"
    ,

    100603: "修改权限"
    ,

    341403: "技术溯源"
    ,

    100103: "街镇用户组"
    ,

    321803: "三级河长"
    ,

    341203: "其它形状"
    ,

    320703: "其他"
    ,

    321903: "池塘"
    ,

    332837: "港口码头排污口"
    ,

    320803: "刺鼻气味"
    ,

    332503: "金属"
    ,

    100803: "其他"
    ,

    110103: "xyz"
    ,

    320903: "工地"
    ,

    332810: "工业及其他各类园区污水处理厂排污口"
    ,

    332403: "污水应纳未纳"
    ,

    332903: "Ⅳ类"
    ,

    322103: "没有排污许可证"
    ,

    320103: "西"
    ,

    321703: "第二排污责任主体"
    ,

    121003: "未完成"
    ,

    321303: "本地存储"
    ,

    320203: "主干河道"
    ,

    120403: "非排口新增"
    ,

    341505: "无人机"
    ,

    321003: "城镇生活污水"
    ,

    120404: "非排口维护"
    ,

    332303: "雨污混接"
    ,

    220203: "一级审核不通过"
    ,

    320904: "村庄"
    ,

    332803: "工业及其他各类园区污水处理厂雨洪排口"
    ,

    332840: "规模以下畜禽养殖排污口"
    ,

    341506: "无人船"
    ,

    320304: "涵闸"
    ,

    350104: "上报溯源难点"
    ,

    342204: "污水应纳未纳"
    ,

    320204: "镇村排口"
    ,

    320104: "北"
    ,

    321004: "畜禽养殖"
    ,

    321604: "多普勒流量计"
    ,

    320804: "水色异常"
    ,

    100504: "图层"
    ,

    100604: "查询权限"
    ,

    100804: "图层资源组"
    ,

    110104: "wmts"
    ,

    332704: "其他"
    ,

    321504: "排放特征照片"
    ,

    322204: "问题已整改"
    ,

    321704: "首要责任主体"
    ,

    321404: "排放总流量"
    ,

    332404: "雨水应纳未纳"
    ,

    332304: "超标排放"
    ,

    332504: "橡胶"
    ,

    332904: "Ⅴ类"
    ,

    121004: "进行中"
    ,

    100104: "其他"
    ,

    333004: "生态环境部长江流域生态环境监督管理局"
    ,

    333304: "混合废污水"
    ,

    333403: "不确定"
    ,

    220254: "已整治"
    ,

    220204: "一级审核通过"
    ,

    334103: "泵站的取水口"
    ,

    321017: "工业废水"
    ,

    322205: "未明确或无溯源条件"
    ,

    334104: "拦河坝、过水涵洞"
    ,

    220205: "二级审核不通过"
    ,

    321705: "其他责任主体"
    ,

    100605: "最高权限"
    ,

    333305: "地表径流"
    ,

    332405: "污水进入雨水管"
    ,

    100805: "遥感数据产品资源组"
    ,

    332802: "其他企事业单位排污口"
    ,

    320905: "港口"
    ,

    100203: "普适内业人员"
    ,

    321505: "排口类别照片"
    ,

    320410: "单一河流过水涵洞"
    ,

    100505: "遥感数据产品"
    ,

    350105: "上报溯源信息"
    ,

    320305: "箱涵"
    ,

    332841: "规模以下水产养殖排污口"
    ,

    341503: "内窥镜"
    ,

    320805: "漂浮物"
    ,

    342205: "逃避监管私自设置的排污口"
    ,

    121005: "已完成"
    ,

    332505: "其他"
    ,

    320205: "水源地"
    ,

    100506: "巡查业务"
    ,

    220206: "二级审核通过"
    ,

    321506: "现场视频"
    ,

    342206: "排污口超标排放"
    ,

    100806: "地区资源组"
    ,

    100306: "其他"
    ,

    320806: "泡沫"
    ,

    333306: "受污水地下水"
    ,

    334105: "地表冲沟、山体渗水"
    ,

    121006: "取消"
    ,

    321005: "水产养殖"
    ,

    341504: "水下机器人"
    ,

    322206: "其他问题已整改"
    ,

    332306: "其他管理问题"
    ,

    332842: "城镇生活污水散排口"
    ,

    321116: "排污源头"
    ,

    320906: "码头"
    ,

    332406: "雨水进入污水管"
    ,

    100204: "普适外业人员"
    ,

    350106: "修改溯源信息"
    ,

    320807: "锈迹"
    ,

    332407: "工业废水超标排放"
    ,

    100807: "智能巡查资源组"
    ,

    341507: "管道机器人"
    ,

    333307: "其他"
    ,

    321117: "其他节点"
    ,

    100307: "可见"
    ,

    342207: "未实现雨污分流"
    ,

    320907: "水田"
    ,

    220207: "复查不通过"
    ,

    321006: "地表径流"
    ,

    100207: "外包人员"
    ,

    334106: "现场未发现入河（海）排污口"
    ,

    332843: "农村污水处理设施排污口"
    ,

    332307: "位于水源保护区等生态敏感区"
    ,

    121007: "关闭"
    ,

    100507: "人员"
    ,

    321507: "现场快检照片"
    ,

    350107: "溯源信息审核通过"
    ,

    350108: "重新编辑"
    ,

    332844: "农村生活污水散排口"
    ,

    320908: "旱地"
    ,

    321508: "现场采样工作照片"
    ,

    220208: "复查通过"
    ,

    100308: "不可见"
    ,

    100508: "切片"
    ,

    100808: "公司资源组"
    ,

    320413: "岸堤/防汛墙裂缝"
    ,

    332408: "城镇污水处理设施出水超标排放"
    ,

    321007: "雨水汇流"
    ,

    320808: "油渍"
    ,

    342208: "存在其他问题"
    ,

    333308: "雨水汇流"
    ,

    332308: "其他排放问题"
    ,

    321008: "地下渗水"
    ,

    321509: "实验室检测报告"
    ,

    100509: "公司"
    ,

    332809: "农业排口"
    ,

    332409: "农村污水处理设施出水超标排放"
    ,

    332845: "市政泵站排口"
    ,

    100809: "用户资源组"
    ,

    320809: "浑浊"
    ,

    320909: "养殖区"
    ,

    220209: "新增整治信息"
    ,

    320414: "其他设施"
    ,

    341509: "其他"
    ,

    350109: "排口变更非排口"
    ,

    333309: "污水处理厂"
    ,

    332410: "生活污水超标排放"
    ,

    333310: "畜禽养殖"
    ,

    1111111111: "工业废水"
    ,

    332846: "港口码头雨洪排口"
    ,

    320910: "林区"
    ,

    350110: "排查信息审核拒绝"
    ,

    321009: "涉农混排"
    ,

    100810: "切片资源组"
    ,

    100510: "排口"
    ,

    321510: "节点工作照片"
    ,

    320810: "黄绿"
    ,

    321511: "溯源工作照片"
    ,

    350111: "溯源信息审核拒绝"
    ,

    100811: "养护资源组"
    ,

    332847: "规模化畜禽养殖雨洪排口"
    ,

    100511: "查询方案"
    ,

    321010: "农田退水"
    ,

    320911: "公园"
    ,

    320812: "无"
    ,

    332411: "其他单位污水超标排放"
    ,

    333311: "涉农混排"
    ,

    321512: "技术取证照片"
    ,

    332412: "雨洪排口排水超标"
    ,

    321011: "雨污混排水"
    ,

    320912: "自然岸线"
    ,

    333312: "农田退水"
    ,

    100512: "区域资源"
    ,

    100812: "巡查资源组"
    ,

    332848: "其他城镇雨洪排口"
    ,

    321513: "技术取证视频"
    ,

    332413: "排口未封堵"
    ,

    320913: "公路"
    ,

    321012: "工地排水"
    ,

    333313: "雨污混排水"
    ,

    100813: "监理资源组"
    ,

    332849: "封堵/废弃排口"
    ,

    321514: "责任主体照片"
    ,

    320914: "铁路"
    ,

    100814: "公共收藏夹"
    ,

    332414: "排口封堵不严实"
    ,

    333314: "公园绿地"
    ,

    321013: "港区排水"
    ,

    321515: "节点照片"
    ,

    332415: "距排口第一节点未封堵"
    ,

    320915: "高速公路"
    ,

    100815: "私有收藏夹"
    ,

    320315: "其他"
    ,

    333315: "工地排水"
    ,

    321014: "旅游设施"
    ,

    100817: "排口资源组"
    ,

    333316: "农村生活污水"
    ,

    320916: "桥"
    ,

    321015: "公园绿地"
    ,

    332416: "距排口第一节点封堵不严实"
    ,

    100816: "查询方案资源组"
    ,

    321516: "水质监测照片"
    ,

    332816: "城镇污水处理厂排污口"
    ,

    321517: "整治方案"
    ,

    320917: "污水处理设施"
    ,

    332417: "地下水渗入雨水管"
    ,

    333317: "城镇生活污水"
    ,

    321518: "责任主体视频"
    ,

    332418: "地下水渗入污水管"
    ,

    320918: "其他"
    ,

    332419: "排口有淤积物"
    ,

    320919: "山地"
    ,

    321519: "现场工作照片"
    ,

    320920: "绿地"
    ,

    332420: "未按规定设置多个雨洪排口"
    ,

    321520: "QV相关截图"
    ,

    332421: "雨洪排口未获得水务部门批准"
    ,

    321521: "相关视频"
    ,

    320921: "道路"
    ,

    320922: "江心洲"
    ,

    321522: "相关文件"
    ,

    332422: "污水渗漏"
    ,

    321523: "节点视频"
    ,

    320923: "水利设施"
    ,

    332423: "污水倒灌"
    ,

    332424: "涉农混排"
    ,

    320924: "荒地"
    ,

    321524: "排口流向图"
    ,

    321525: "其他责任主体照片"
    ,

    320925: "堆场"
    ,

    332425: "地下水渗入污水管"
    ,

    332426: "地下水渗入雨水管"
    ,

    321526: "污水疑似来源照片"
    ,

    321527: "难点照片"
    ,

    321528: "溯源手段照片"
    ,

    332836: "其他排口"
    ,

    321016: "其他"
    ,

    320811: "其他"
    ,

    332850: "其他排污口"
    ,

    334107: "其他"
    ,

    324301: "服务器繁忙，请稍后再试"
    ,

    324302: "表单上传失败，请检查后重新提交"
    ,

    324303: "表单上传失败，请检查后重新提交"
    ,

    324304: "表单上传失败，请检查后重新提交"
    ,

    324305: "网络超时，请稍后再试"
    ,

    324319: "视频损坏或视频过大，请检查后重新提交"
    ,

    324306: "网络超时，请稍后再试"
    ,

    324318: "图片损坏或图片过大，请检查后重新提交"
    ,

    324317: "无网络，请检查网络"
    ,

    324307: "网络超时，请稍后再试"
    ,

    324308: "网络超时，请稍后再试"
    ,

    324310: "当前未登录，请登录后重试"
    ,

    324309: "网络超时，请稍后再试"
    ,

    324311: "网络超时，请稍后再试"
    ,

    324312: "请选择要上传的表单"
    ,

    324313: "找不到表单，请确认"
    ,

    324314: "网络超时，请稍后再试"
    ,

    324315: "失败，请重试"
}
